Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Flag for setSystemUiVisibility(int): When using other layout flags, we would like a stable view of the content insets given to fitSystemWindows(Rect).
zh_cn: 用于 setSystemUiVisibility(int) 的标志：当使用其他布局标志时，我们希望一个稳定的 view，其内容 insets 由 fitSystemWindows(Rect) 给定。

source: Flag for setSystemUiVisibility(int): When using other layout flags, we would like a stable view of the content insets given to fitSystemWindows(android.graphics.Rect).
zh_cn: 用于 setSystemUiVisibility(int) 的标志：当使用其他布局标志时，我们希望一个稳定的 view，其内容 insets 由 fitSystemWindows(android.graphics.Rect) 给定。

source: Flag indicating that a drag can cross window boundaries.
zh_cn: 指示拖动可以跨越窗口边界​​的标志。

source: Flag indicating that the drag shadow will be opaque.
zh_cn: 指示拖动阴影将不透明的标志。

source: Flag indicating that this Window is responsible for drawing the background for the system bars.
zh_cn: 指示此窗口负责绘制系统栏背景的标志。

source: Flag requesting you to add views that are marked as not important for autofill (see setImportantForAutofill(int)) to a ViewStructure.
zh_cn: 请求你添加标记为对自动填充不重要的 view 的标记(请参阅 setImportantForAutofill(int)) 到 ViewStructure。

source: Flag to indicate that cancel has been called on this object.
zh_cn: 标记以指示已在该对象上调用取消。

source: Flags a view so that it will not be scrapped or recycled.
zh_cn: 标记一个 view，它将不会被弃用或复用。

source: Flags indicating the current axes of nested scrolling
zh_cn: 指示嵌套滚动的当前轴的标志

source: Flags that can impact the layout in relation to system UI.
zh_cn: 可能影响与系统 UI 相关的布局的标志。

source: Flattening your view hierarchy by reducing redundant or nested layouts.
zh_cn: 通过减少冗余或嵌套布局来展平视图层次结构。

source: Flinging up or down allows for multiple increments or decrements of the current value.
zh_cn: 向上或向下投掷允许当前值的多个增量或减量。

source: Floating action buttons are used for a special type of promoted action.
zh_cn: 浮动操作按钮用于特殊类型的提升操作。

source: Floating action buttons come in two sizes: the default and the mini.
zh_cn: 浮动操作按钮有两种尺寸：默认和迷你。

source: Focus
zh_cn: 焦点

source: Focus Handling
zh_cn: 焦点处理

source: Focus movement is based on an algorithm which finds the nearest neighbor in a given direction.
zh_cn: 焦点移动基于一个找出所给方向最近的邻居的算法。

source: Follow Field Naming Conventions
zh_cn: 遵循字段命名规范

source: Follow test method naming conventions and use an underscore to separate what is being tested from the specific case being tested.
zh_cn: 请遵循测试方法的命名规范，并使用下划线将被测试的内容与被测试的具体情况区分开来。

source: For a Drawable or an immutable Bitmap, this is the only way to process the image after decoding.
zh_cn: 对于 Drawable 或不可变的 Bitmap，这是解码后处理图像的唯一方法。

source: For a dialog using this view, see DatePickerDialog.
zh_cn: 有关使用此 view 的对话框，请参阅 DatePickerDialog。

source: For a dialog using this view, see TimePickerDialog.
zh_cn: 有关使用此 view 的对话框，请参阅 TimePickerDialog。

source: For a flag, set the flag attribute:
zh_cn: 对于一个标志，设置标志属性：

source: For a matcher m with input sequence s, the expressions m.group() and s.substring(m.start(), m.end()) are equivalent.
zh_cn: 对于匹配器 m、输入序列 s，表达式 m.group() 和 s.substring(m.start(), m.end()) 是等效的。

source: For a matcher m, input sequence s, and group index g, the expressions m.group(g) and s.substring(m.start(g), m.end(g)) are equivalent.
zh_cn: 对于匹配器 m，输入序列 s 和组索引 g，表达式 m.group(g) 与 s.substring(m.start(g), m.end(g)) 是等效的。

source: For a more complete example of creating a custom adapter, see the Custom Choice List sample app.
zh_cn: 有关创建自定义适配器的更完整示例，请参阅 Custom Choice List 示例应用程序。

source: For a more modern, flexible, and performant approach to displaying lists, use RecyclerView.
zh_cn: 要获得更现代，更灵活，更高效的列表显示方法，请使用 RecyclerView。

source: For a non-interactive indicator, see PagerTitleStrip.
zh_cn: 有关非交互式指标，请参阅 PagerTitleStrip。

source: For a simple example, see the discussion of filling an adapter view with text in the Layouts guide.
zh_cn: 有关一个简单示例，请参阅 Layouts 指南中使用文本填充适配器 view 的讨论。

source: For a touch capable device, once the user touches the screen, the device will enter touch mode.
zh_cn: 对于具有触控功能的设备，一旦用户触摸屏幕，设备将进入触摸模式。

source: For a visual overview of the difference between determinate and indeterminate progress modes, see Progress & activity.
zh_cn: 有关确定和不确定进度模式之间差异的直观概述，请参阅 Progress & activity。

source: For all XML style attributes available on Button see Button Attributes, TextView Attributes, View Attributes.
zh_cn: 对于 Button 上可用的所有 XML 样式属性，请参阅 Button Attributes，TextView Attributes，View Attributes。

source: For an Intent going to a Service, the permissions are available as long as the Service is running.
zh_cn: 对于转到 Service 的 Intent ，只要 Service 正在运行，权限就是可用的。

source: For an animated image, the drawing commands drawn on the Canvas will be recorded immediately and then applied to each frame.
zh_cn: 对于动画图像，将立即记录在 Canvas 上绘制的绘图命令，然后应用于每个帧。

source: For an example of using this widget, see TimePicker.
zh_cn: 有关使用此小组件的示例，请参阅 TimePicker。

source: For an interactive indicator, see PagerTabStrip.
zh_cn: 有关交互式指示符，请参阅 PagerTabStrip。

source: For as long as you return false from this function, each following event (up to and including the final up) will be delivered first here and then to the target's onTouchEvent().
zh_cn: 只要你从这个函数返回 false，每个后续事件(直到并包括最后一个 up)将首先转发到这里，然后转发到目标的 onTouchEvent()。

source: For containers holding up to hundreds of items, the performance difference is not significant, less than 50%.
zh_cn: 对于容纳数百项的容器，性能差异不显著，小于 50%。

source: For convenience, this class also provides several blending modes, which similarly define the result of compositing a source and a destination but without being constrained to the alpha channel.
zh_cn: 为了方便起见，这个类还提供了几种混合模式，它们类似地定义了合成源与目标的结果，但不限制于 alpha 通道。

source: For detailed reference information, see the View class.
zh_cn: 对于详细的参考信息，见 View 类。

source: For each <declare-styleable> resource in the res directory, the generated R.java defines both an array of attribute ids and a set of constants that define the index for each attribute in the array.
zh_cn: 对于 res 目录中的每个 <declare-styleable> 资源，生成的 R.java 定义属性 id 数组和一组常量，这些常量定义数组中每个属性的索引。

source: For each dimension, it can specify one of:
zh_cn: 对于每一个尺寸，它可以被申明为以下几个之一：

source: For example an opaque 8-bit image may be compressed into an Bitmap.Config.RGB_565 configuration, sacrificing image quality to save memory.
zh_cn: 例如，不透明的 8 位图像可能被压缩为 Bitmap.Config.RGB_565 配置，牺牲图像质量以节省内存。

source: For example the following will make the left side with a 30% bias instead of the default 50%, such that the left side will be shorter, with the widget leaning more toward the left side (Fig. 5):
zh_cn: 例如，以下将使左侧具有 30％的偏置值，而不是默认的 50％，这样左侧将会更短，窗口小部件靠近左侧(图 5)：

source: For example when the view is not attached to the screen, the payload in notifyItemChange() will be simply dropped.
zh_cn: 例如，当 view 未附加到屏幕时，notifyItemChange() 中的 payload 将被简单地删除。

source: For example, sampleSize == 4 returns an image that is 1/4 the width/height of the original, and 1/16 the number of pixels.
zh_cn: 例如，sampleSize == 4 返回的图像是原始宽度/高度的 1/4，像素数的 1/16。

source: For example, AbsoluteLayout has its own subclass of LayoutParams which adds an X and Y value.
zh_cn: 比如，AbsoluteLayout 有自己的 LayoutParams 子类，该子类添加了 X 和 Y 值。

source: For example, If one dimension is constrained by two targets (e.g. width is 0dp and centered on parent) you can indicate which side should be constrained, by adding the letter W (for constraining the width) or H (for constraining the height) in front of the ratio, separated by a comma:
zh_cn: 比如，如果一个尺寸受两个目标约束(如宽度是 0dp 并且在 parent 中居中)，你可以指定应限制哪一边，通过在比例前添加字母 W(用于约束宽度)或 H (用于约束高度)用逗号隔开。

source: For example, a Button exposes a listener to notify clients when the button is clicked.
zh_cn: 比如，Button 公开了一个监听器可以在点击时通知用户。

source: For example, a Combo Box can be thought of as a combination of a single line EditText field and an adjacent button with an attached PopupList.
zh_cn: 比如，Combo Box 可被认为是一个单行的 EditText 和一个与 PopupList 相邻的按钮组成而成。

source: For example, a LinearLayout may call measure() on its child with the height set to UNSPECIFIED and a width of EXACTLY 240 to find out how tall the child view wants to be given a width of 240 pixels.
zh_cn: 比如，一个 LinearLayout 可能把高度设为 UNSPECIFIED，把宽度设为 EXACTLY 240，然后在子 view 上调用 measure() 方法，以找出在给定宽度 240 像素时子 view 想要多高。

source: For example, a large distance will result in a large viewing angle, and there will not be much perspective distortion of the view as it rotates.
zh_cn: 例如，较大的距离将导致较大的视角，并且在旋转时 view 将不会有太多的透视畸变。

source: For example, a left barrier will align to the left of all the referenced views.
zh_cn: 例如，左侧屏障将对齐所有引用 view 的左侧。

source: For example, all views will let you set a listener to be notified when the view gains or loses focus.
zh_cn: 比如，所有的 view 都允许设置一个监听器，在得到或失去焦点时收到通知。

source: For example, consider android.app.Activity.startActivity(android.content.Intent):
zh_cn: 比如，考虑 android.app.Activity.startActivity(android.content.Intent):

source: For example, consider a task consisting of four activities: A, B, C, D. If D calls startActivity() with an Intent that resolves to the component of activity B, then B will be brought to the front of the history stack, with this resulting order: A, C, D, B. This flag will be ignored if FLAG_ACTIVITY_CLEAR_TOP is also specified.
zh_cn: 例如，考虑一个由四个 activity 组成的任务：A，B，C，D。如果 D 使用解析为 activity B 的组件的 Intent 调用 startActivity()，则 B 将被带到历史堆栈的前面，其结果顺序为：A、C、D、B。此标志将被忽略，如果 FLAG_ACTIVITY_CLEAR_TOP 也被指定。

source: For example, consider a task consisting of the activities: A, B, C, D. If D calls startActivity() with an Intent that resolves to the component of activity B, then C and D will be finished and B receive the given Intent, resulting in the stack now being: A, B.
zh_cn: 例如，考虑一个由以下 activity 组成的任务：A、B、C、D。如果 D 调用 startActivity()的 Intent 解析为 activity B 的组件，则 C 和 D 将 finish，B 将接收给定的 Intent，从而导致堆栈现在为：A、B。

source: For example, extend BaseAdapter and create and configure the view for each data item in getView(...):
zh_cn: 例如，继承 BaseAdapter 并为 getView(...) 中的每个数据项创建和配置 view：

source: For example, figure 13 shows two views that both have a constraint to each other, thus creating a horizontal chain.
zh_cn: 例如，图 13 示出了两个 view，它们都具有彼此的约束，从而创建了一个水平链。

source: For example, figure 7 shows B with a 24dp offset alignment.
zh_cn: 例如，图 7 展示了 B 的对齐具有 24dp 偏移量。

source: For example, for plain text input set inputType to "text":
zh_cn: 例如，对于纯文本输入，将 inputType 设置为“text”：

source: For example, here's how to use the attributes defined for PieChart:
zh_cn: 例如，以下是如何使用为 PieChart 定义的属性：

source: For example, here's the code that draws PieChart.
zh_cn: 例如，这是绘制 PieChart 的代码。

source: For example, if a thread modifies a collection directly while it is iterating over the collection with a fail-fast iterator, the iterator will throw this exception.
zh_cn: 例如，如果线程使用快速失败迭代器在 collection 上迭代时直接修改该 collection，则迭代器将抛出此异常。

source: For example, if a user has a hdpi device, they don’t need xxxhdpi resources that you might include for devices with higher density displays.
zh_cn: 例如，如果用户具有 hdpi 设备，则他们不需要 xxxhdpi 资源，这些资源可能包含在具有更高密度显示的设备中。

source: For example, if grid has 3 columns and each item occupies 1 span, span group index for item 1 will be 0, item 5 will be 1.
zh_cn: 比如，如果一个 grid 有 3 列，每个 item 占据 1 个 span，则 item 1 的 span group index 为 0（指第 1 行），item 5 的 span group index 为 1（指第 2 行）。

source: For example, if the background of the BottomAppBar is colorSurface, as it is in the default style, you should set materialThemeOverlay to @style/ThemeOverlay.MaterialComponents.BottomAppBar.Surface.
zh_cn: 例如，如果 BottomAppBar 的背景是 colorSurface，因为它是默认样式，你应该将 materialThemeOverlay 设置为 @style/ThemeOverlay.MaterialComponents.BottomAppBar.Surface。

source: For example, if the view only has its bottom 25% displayed, it will be scrolled off screen completely.
zh_cn: 例如，如果 view 仅显示其底部 25％，则它将完全滚出屏幕。

source: For example, if we have something like:
zh_cn: 例如，如果我们有这样的东西：

source: For example, if you have a list of items on the screen and user asks for the 5th element, you should use these methods as they'll match what user is seeing.
zh_cn: 例如，如果你在屏幕上有一个项目列表，用户要求使用 第 五个项目元素时，你可以使用这些方法, 因为这些方法对应的位置就是用户看到的位置。

source: For example, if you set colorOnSurface in your theme to red (#FF0000).
zh_cn: 例如，如果将主题中的 colorOnSurface 设置为红色(#FF0000)。

source: For example, if you set both sides to "match constraints", click Toggle Aspect Ratio Constraint twice to set the width be a ratio of the height.
zh_cn: 例如，如果你将两边设置为 "match constraints"，点击 click Toggle Aspect Ratio Constraint 两次来将宽度设置为高度的比率。

source: For example, if you use the @inheritdocs Javadoc tag, and derive from a class (not an interface), you must also annotate that the method @Overrides the parent class's method.
zh_cn: 例如，如果你使用 @inheritdocs Javadoc 标记，并且派生于某个类(而非接口)，则必须再为方法添加 @Override 注释，说明该方法替换了父类的方法。

source: For example, if you want to accept a secret number, like a unique pin or serial number, you can set inputType to "numericPassword".
zh_cn: 例如，如果要接受密码，例如唯一的密码或序列号，可以将 inputType 设置为“numericPassword”。

source: For example, if you want to access the item in the adapter on a ViewHolder click, you should use RecyclerView.ViewHolder.getAdapterPosition().
zh_cn: 例如，如果要在 ViewHolder 单击时访问适配器中的项目，则应使用 RecyclerView.ViewHolder.getAdapterPosition()。

source: For example, if you want to access the item in the adapter on a ViewHolder click, you should use getAdapterPosition().
zh_cn: 比如，当你点击了 ViewHolder，你想获取 adapter 中的 item，你应该使用 getAdapterPosition()。

source: For example, images should not immediately pop out of existence and reappear somewhere else, because objects in the real world don't do that.
zh_cn: 例如，图像不应该立即弹出并重新出现在其他地方，因为现实世界中的对象不会这样做。

source: For example, in order to position button B to the right of button A (Fig. 1):
zh_cn: 例如，为了将按钮 B 放置在按钮 A 的右侧(图 1)：

source: For example, inSampleSize == 4 returns an image that is 1/4 the width/height of the original, and 1/16 the number of pixels.
zh_cn: 例如，inSampleSize == 4 返回的图像是原始宽度/高度的 1/4，以及像素数量的 1/16。

source: For example, it is not generally permissible for one thread to modify a Collection while another thread is iterating over it.
zh_cn: 例如，某个线程在 Collection 上进行迭代时，通常不允许另一个线性修改该 Collection。

source: For example, many protocol buffer tools generate an excessive number of methods and classes, which can double or triple the size of your app.
zh_cn: 例如，许多协议缓冲工具会生成过多的方法和类，这可能会使应用程序的大小增加一倍或三倍。

source: For example, rather than creating global static objects, instead, move to a singleton pattern, where the app initalizes objects only the first time it accesses them.
zh_cn: 例如，不是创建全局静态对象，而是移动到单例模式，其中应用程序仅在第一次访问对象时初始化对象。

source: For example, suppose your app is offering files to other apps with a FileProvider that has the authority com.mydomain.fileprovider.
zh_cn: 例如，假设你的应用程序使用具有 com.mydomain.fileprovider 权限的 FileProvider 将文件提供给其他应用程序。

source: For example, the aapt tool can convert a true-color PNG that does not require more than 256 colors to an 8-bit PNG with a color palette.
zh_cn: 例如，aapt 工具可以将不需要超过 256 种颜色的真彩色 PNG 转换为带有调色板的 8 位 PNG。

source: For example, the SDK includes a NotePad application in the samples.
zh_cn: 比如，SDK 中包含一个 NotePad application 的例子。

source: For example, the code may look like this:
zh_cn: 例如，代码可能如下所示：

source: For example, the finalize method for an object that represents an input/output connection might perform explicit I/O transactions to break the connection before the object is permanently discarded.
zh_cn: 例如，表示输入/输出连接的对象的 finalize 方法可能会执行显式 I/O 事务，以在永久丢弃该对象之前中断连接。

source: For example, the following paths element tells FileProvider that you intend to request content URIs for the images/ subdirectory of your private file area.
zh_cn: 例如，下面的 paths 元素告诉 FileProvider 你打算为私有文件区域的 images/ 子目录请求 content URI。

source: For example, the parent may measure each child once with unspecified dimensions to find out how big they want to be, then call measure() on them again with actual numbers if the sum of all the children's unconstrained sizes is too big or too small.
zh_cn: 比如，父 view 可能先用未指明的尺寸来测量一遍所有的子 view，以查明子 view 们想要多大。然后如果子 view 的不受约束的尺寸总和太大或太小，则父类再以实际数字调用一次 measure() 方法。

source: For example, the percent remaining of a file being retrieved, the amount records in a batch written to database, or the percent remaining of an audio file that is playing.
zh_cn: 例如，正在获取的文件的剩余百分比，写入数据库的批处理中的记录数量，或正在播放的音频文件的剩余百分比。

source: For example, the snippet above sets android:gravity to "center".
zh_cn: 例如，上面的代码片段将 android:gravity 设置为“center”。

source: For example, these XML elements specify two directories:
zh_cn: 例如，这些 XML 元素指定了两个目录：

source: For example, this is acceptable:
zh_cn: 例如，我们接受以下样式：

source: For example, this is correct:
zh_cn: 正确示例如下：

source: For example, to create a sampled image with half the width and height of the original image, call setTargetSampleSize(2) inside onHeaderDecoded:
zh_cn: 例如，要创建具有原始图像宽度和高度的一半的采样图像，请在 onHeaderDecoded 内调用 setTargetSampleSize(2)：

source: For example, to decode a full size image and its thumbnail, the same Source can be used once with no OnHeaderDecodedListener and once with an implementation of onHeaderDecoded that calls ImageDecoder.setTargetSize(int, int) with smaller dimensions.
zh_cn: 例如，要解码完整尺寸的图像及其缩略图，可以使用相同的 Source，一次不使用 OnHeaderDecodedListener，一次使用 onHeaderDecoded 调用尺寸较小的 ImageDecoder.setTargetSize(int, int)。

source: For example, to decode from a File, call createSource(File) and pass the result to decodeDrawable(Source) or decodeBitmap(Source):
zh_cn: 例如，要从 File 进行解码，请调用 createSource(File) 并将结果传递给 decodeDrawable(Source) 或 decodeBitmap(Source)：

source: For example, when the user selects one or more items in your activity, you can enable an action mode that offers actions specific to the selected items, with a UI that temporarily replaces the action bar.
zh_cn: 例如，当用户选择 activity 中的一个或多个项目时，你可以启用一种操作模式，该模式提供特定于所选项目的操作，并使用临时替换操作栏的 UI。

source: For example, when users fling a UI object, they should sense friction at the beginning that delays the motion, and then at the end sense momentum that carries the motion beyond the fling.
zh_cn: 例如，当用户投掷 UI 对象时，他们应该在开始时感知延迟运动的摩擦，然后在结束时感知带动运动超出投掷的动量。

source: For example, you can add them to a new file called res/xml/file_paths.xml.
zh_cn: 例如，你可以将它们添加到名为 res/xml/file_paths.xml 的新文件中。

source: For example, you cannot assign a position to span 2 while span 1 is empty.
zh_cn: 比如，如果 span 1 是空的，你就不能为 span 2 分配位置。

source: For example, you cannot have a RelativeLayout whose height is set to WRAP_CONTENT and a child set to ALIGN_PARENT_BOTTOM.
zh_cn: 例如，你不能将 RelativeLayout 的高度设置为 WRAP_CONTENT，并将子项设置为 ALIGN_PARENT_BOTTOM。

source: For example, you might create a new drawable file and reference it from the layout XML and app manifest file as follows:
zh_cn: 例如，你可以创建一个新的可绘制文件，并从布局 XML 和应用程序清单文件中引用它，如下所示：

source: For example, you might reference the Android Support Library to improve the user experience on older devices, or you could use Google Play Services to retrieve automatic translations for text within your app.
zh_cn: 例如，你可以引用 Android Support Library 来改善旧设备上的用户体验，或者你可以使用 Google Play Services 来获取应用中文本的自动翻译。

source: For example:
zh_cn: 例如：

source: For exemple, on a chain containing two elements using MATCH_CONSTRAINT, with the first element using a weight of 2 and the second a weight of 1, the space occupied by the first element will be twice that of the second element.
zh_cn: 例如，在一个链中包含 2 个元素使用 MATCH_CONSTRAINT，第一个元素使用权重为 2，第二个元素使用权重为 1，则第一个元素占据的空间将是第二个元素占据空间的 2 倍。

source: For filled buttons, this class uses your theme's ?attr/colorPrimary for the background tint color and ?attr/colorOnPrimary for the text color.
zh_cn: 对于填充按钮，此类使用主题的 ?attr/colorPrimary 作为背景色调颜色，使用 ?attr/colorOnPrimary 作为文本颜色。

source: For horizontal scrolling, use HorizontalScrollView instead.
zh_cn: 对于水平滚动，请改用 HorizontalScrollView。

source: For indices outside of the range 0...size()-1, the behavior is undefined.
zh_cn: 对于范围 0...size()-1 之外的索引，行为未定义。

source: For information about how to use the action bar, including how to add action items, navigation modes and more, read the Action Bar developer guide.
zh_cn: 有关如何使用操作栏的信息，包括如何添加操作项，导航模式等，请阅读 Action Bar 开发人员指南。

source: For information about using SearchView, read the Search API guide.
zh_cn: 有关使用 SearchView 的信息，请阅读 Search API 指南。

source: For information about using SearchView, read the Search developer guide.
zh_cn: 有关使用 SearchView 的信息，请阅读 Search 开发人员指南。

source: For information about using this class to develop your application's user interface, read the User Interface developer guide.
zh_cn: 有关使用该类开发应用程序的用户界面，请阅读 User Interface。

source: For information on how Google Play collects Android vitals data, see the Play Console documentation.
zh_cn: 有关 Google Play 如何收集 Android 重要数据的信息，请参阅 Play Console 文档。

source: For information, see Inspect CPU activity with CPU Profiler.
zh_cn: 有关信息，请参见 Inspect CPU activity with CPU Profiler。

source: For instance, Canvas provides a method to draw a line, while Paint provides methods to define that line's color.
zh_cn: 例如，Canvas 提供了绘制线条的方法，而 Paint 提供了定义该线条颜色的方法。

source: For instance, PieChart exposes a custom event called OnCurrentItemChanged to notify listeners that the user has rotated the pie chart to focus on a new pie slice.
zh_cn: 例如，PieChart 公开一个名为 OnCurrentItemChanged 的自定义事件，以通知监听器用户已旋转饼图聚焦到新的饼图切片。

source: For instance, a left padding of 2 will push the view's content by 2 pixels to the right of the left edge.
zh_cn: 比如，left padding 为 2 将把 view 推到距离左边缘 2 像素的位置。

source: For instance, calling getRight() is similar to the following computation: getLeft() + getWidth() (see Size for more information about the width.)
zh_cn: 比如调用 getRight() 和下面的计算相似：getLeft() + getWidth() (有关 width 的更多知识见 Size

source: For instance, if you use a TextureView to display the camera preview, you cannot use lockCanvas() to draw onto the TextureView at the same time.
zh_cn: 例如，如果使用 TextureView 显示相机预览，则不能同时使用 lockCanvas() 绘制到 TextureView 上。

source: For instance, on a medium density display, the default distance is 1280.
zh_cn: 例如，在中密度显示器上，默认距离为 1280。

source: For instance, subclasses of this class can display the content of the list in a grid, in a carousel, as stack, etc.
zh_cn: 例如，此类的子类可以在网格中，在轮播中，作为堆栈等显示列表的内容。

source: For instance, the PieChart class has an inner class called PieView.
zh_cn: 例如，PieChart 类有一个名为 PieView 的内部类。

source: For instance, this code creates a class that extends GestureDetector.SimpleOnGestureListener and overrides onDown(MotionEvent).
zh_cn: 例如，此代码创建一个继承 GestureDetector.SimpleOnGestureListener 的类，并重写 onDown(MotionEvent)。

source: For instance, when getLeft() returns 20, that means the view is located 20 pixels to the right of the left edge of its direct parent.
zh_cn: 例如，如 getLeft() 返回 20，表示 view 位于父 view 左边缘向右 20 像素处。

source: For instance, without dithering, the result might show a greenish tint.
zh_cn: 例如，没有 dithering，结果可能会显示淡绿色。

source: For instance, you can make a TextureView semi-translucent by calling myView.setAlpha(0.5f).
zh_cn: 例如，你可以通过调用 myView.setAlpha(0.5f) 使 TextureView 半透明。

source: For instance:
zh_cn: 例如：

source: For larger sets of pages, consider FragmentStatePagerAdapter.
zh_cn: 对于较多数量的 pages，推荐使用 FragmentStatePagerAdapter。

source: For layout purposes, GridLayout treats views whose visibility status is View#GONE, as having zero width and height.
zh_cn: 出于布局目的，GridLayout 将可见性状态为 View#GONE 的 view 视为零宽度和高度。

source: For lower versions of the platform, use the ColorFilter class.
zh_cn: 对于平台的较低版本，请使用 ColorFilter 类。

source: For more details and code samples, see the Styling Your Button guide.
zh_cn: 有关更多详细信息和代码示例，请参阅 Styling Your Button 指南。

source: For more examples, see Common Layout Objects.
zh_cn: 更多实例，请参见 Common Layout Objects.

source: For more fine-grained control over security, consider overriding the onFilterTouchEventForSecurity(MotionEvent) method to implement your own security policy.
zh_cn: 要更好好控制安全性，考虑重写 onFilterTouchEventForSecurity(MotionEvent) 方法来实现自己的安全策略。
